# 2. Data Types

## 2.1. Variables:

- The below code defines use of assignment operator in declaring variables of different types.
- We then print out the values stored in them.
- Print here is a function.

In [10]:
# Define variables with different types
counter= 100.00  # float type variable
miles= 100  # integer type variable
name = "Mehvish"  # string type variable

# Print all values
print(counter)
print(miles)
print(name)

100.0
100
Mehvish

## 2.2. Numbers:

- The below code defines use of directly printing integers without declaring them to a variable.

In [11]:
2 #integer

2

- The below code outputs the result of numeric operation of addition.

In [12]:
 2+3 #integer

5

- The below code doutputs the result of addition of float type numbers.

In [13]:
2.3+5.5 #float

7.8

- The below code outputs the result of numeric operation of exponential.

In [14]:
2**2 #exponent

4

## 2.3. Strings:

- The below code defines use of strings using single comma and double comma.
- Print can be used to concatenate strings.

In [15]:
name= 'usama'
university= "NUST"
print(name, university)

usama NUST

****a. Access values in String****
- The below code first prints out the 0th character using bracket. Index starts from 0.
- Then it prints the 1st to 5th character.

In [16]:
stringVariable = "Hello World"
print("stringVariable[0]:",stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

****b. Updating String****
- The below code replaces the 'World' with 'Python'. It starts to replace from 6th index and continues till end.
- Note it will replace the whole string on the right irrespective of the size of new addition.

In [17]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6]+"Python" 
print("Updated string: ", stringVariable)

Updated string:  Hello Python

****c. Delete String****
- The below code demonstrates the use of del operation. It deletes the entries of the variable "stringVariable".

In [18]:
stringVariable = "Hello World"
print(stringVariable)
del stringVariable
print(stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

****d. String special operators****
- The below code demonstrates the use of + operation within the print statement/function.
- It concatenates the Hello and Python strings.

In [19]:
variable = "Hello"
print(variable+"Python")

HelloPython

- The below code demonstrates the use of * operation within the print statement/function.
- It replicates the Hello string thrice.

variable = "Hello"
print(variable*3)

- The below code demonstrates the use of [] operation within the print statement/function.
- It outputs the character e present at index 1.

In [20]:
variable = "Hello"
print(variable[1])

e

- The below code demonstrates the use of [:] operation within the print statement/function.
- It outputs the character el starting from index 1 to 3.
- Notice it didnt print l again. Only printed till 2nd index.

In [21]:
variable = "Hello"
print(variable[1:3])

el

- The below code demonstrates the use of "in" operation within the print statement/function.
- It outputs True if character exists in the string.
Here, it returns True because H is present.

In [22]:
variable = "Hello"
print('H' in variable)

True

- The below code demonstrates the use of "not in" operation within the print statement/function.
- It outputs True if character doesn't exists in the string.
Here, it returns True because G is not present.

In [23]:
variable = "Hello"
print('G' not in variable)

True

****e. String formatting operator****
- The below code demonstrates the use of % operator within the print function.
- It takes in the values of string and number from %s and %d values.

In [24]:
print("My name is %s and age is %d years!" % ("Usama",30))

My name is Usama and age is 30 years!

## 2.4. Lists

The below code prints the entries defined in list.

In [25]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

****a. Accessing values in Lists****
- The below code prints the specific values from the list entries defined above.

In [26]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ]; 
print ("list1[0]: ", list1[0]) 
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

****b. Updating Lists****
- The below code accesses the 1st index entry and changes chemistry to computer science. Then the append function adds Computer science at the last.

In [27]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1) 
list1.append('Computer Science') 
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

****c. Delete List Element****
- The below code uses del to remove the entry at specific index in the list.

In [2]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
del list1[2];
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

- The below code uses remove function to delete the specific entry inside the list without knowing the index location.

In [4]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
list1.remove('chemistry')
print ("After deleting value at index 1: ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 1:
['physics', 1997, 2000]

## 2.5. Dictionaries

- The below code depicts the use of dictionary. It is based on key and values seperated by :.

****a. Accessing value in Dictionary****
- We are printing the value contained in key 'Name'.

In [5]:
dict = {'Name':"Usama", 'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Usama

****b. Updating Dictionary****
- The below code prints the entries of dict. Then changes the value contained in key 'Batch'. Then adds another key:value named university: NUST.

In [6]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict) 
dict['University'] = "NUST" 
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'NUST'}

- The below code deletes the entry of key named Batch alongwith its value.

In [32]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
print (dict) 
del dict['Batch'] 
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

- The below code clears all the entries of the dict using clear function.

In [33]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
dict.clear() 
print (dict)

{}

## 2.6. Tuples

- Same as Lists. But they are fixed entries.

****a. Accessing values in Tuples****
- The below code prints the tuple content in tup. Then prints the value at index 1. Then prints  entries from 1 index to 3.

In [34]:
tup = ('Math','98', 'C programming', '99')
print (tup) 
print(tup[1]) 
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

****b. Updating Tuples****
- The below code concatenates two tuples.

In [35]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz'); 
#Following action is not valid for tuples 
#tup1[0] = 100; 
#So let's create a new tuple as follows 
tup3 = tup1 + tup2; 
print (tup3);

(12, 34.56, 'abc', 'xyz')

****c. Deleting Tuples****
- The below code deletes the entire tuple.

In [36]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

## 2.7. Sets

- The below code prints the type of list1 as List.
- Then it makes it a set.
- Then prints its entities.
- Then again prints the type as Set.
- Then it overwrites the set with new values. Prints it.
- Then we redefine set again. Add D. Add multiple values from list entries.
- Then use remove and discard functions to test error function.

In [13]:
 #list
list1 = [1,2,3,4,5]

print (type(list1)) 

my_set = set(list1) 

print(my_set) 
print(type(my_set)) 

#set of integers 
my_set = {1,2,3} 
print (my_set)
#set of mixed data types 
my_set = {1,"Hello", 1.2,'C'} 
#adding a single value 
my_set.add('D') 
#adding multiple values 
my_set.update(list1) 
print (my_set) 
my_set.discard('G') # it will not raise an error 
my_set.remove('G') # it will raise an error

<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>
{1, 2, 3}
{1.2, 1, 2, 3, 4, 5, 'C', 'D', 'Hello'}

KeyError: 'G'

# 3. Comparison Operators

- The below code examples demonstrate the use of comparatoor o-perators and return True or False based on the result's truthfulness.

In [38]:
1<3

True

In [39]:
15 <= 23

True

In [40]:
'Mehvish' == "Zeenat"

False

In [41]:
"Mehvish" != "Mehvish"

False

In [42]:
(1==1)or(5>2)

True

In [43]:
(1<2)and(2<1)

False

# 4. If-Else Statements

- The below code prints Even or odd based on the number input.

In [17]:
if 25 % 2: 
    print('Odd')
else: 
    print('Even')

Odd

# 5. For and While Loop

- The below code calculates the factorial using the for loop.

In [20]:
#example of for loop
fact = 1
N = 5
for i in range (1,N+1): 
    fact*=i 
print (fact)

120

- The below code prints the 1 to 10 using while loop.

In [24]:
 #example of while loop
a = 0
while a < 10: 
    a = a+1
    print(a)

1
2
3
4
5
6
7
8
9
10

# 6. Functions

- The below code uses the function and prints the defined string by calling the function.

In [47]:
# Function definition is here
def printme( str ): 
#This prints a passed string into this function 
    print (str)
    return; 
# Now you can call printme function 
printme("I'm first call to user defined function!")

I'm first call to user defined function!

# 7. Lambda Functions

- They need 1 input and 1 expression.
- The below code defines use of normal function.

In [48]:
#Normal function 
def f (x): 
    return x**2 
print (f(8))

64

- The below code defines use of lambda function.

In [28]:
#Lambda Function 
#lambda expressions
times3 = lambda var:var*3 
times3(10) 
#lambda expressions: another way to write a function in line

30

## 7.1 Map

- The below code defines use of map function. Returns the split of woirds in sentences and also the number of characters in each word.

In [33]:
sentence = 'It is raining cats and dogs' 
words = sentence.split()
print (words) 
lengths = map(lambda x: len(x), words) 
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

## 7.2 Filter

- The below code defines use of filter on lambda function that finds if the input is odd. Remainder is 0, so it is False.

In [51]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

- The below code defines use of filter on lambda function that finds iof the input is even.

In [52]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result2 = filter(lambda x: x % 2 == 0, fib) 
list (result2)

[0, 2, 8, 34]

# 8. File I/O

- The below code defines use of assignment operator in declaring variables of different types.

## 8.1 Reading input from keyboard
- It reads only one line from standard input and returns it as a string.

In [34]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Usama

Usama

## 8.2 I/O from or to Text File
- r opens a file in read only mode.
- r+ opens a file read and write mode.
- w opens a file in write mode only.
- a opens a file in append mode
- a+ opens a file in append and read mode
- Open a file to read

In [68]:
# Open a file to read 
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file 
print (str)
# Close opened file 
fileOpen.close()

Hello. my name is Usama Javaid. I have a Masters in Electrical Engineering.

- The below code defines use of appending the files.

In [70]:
# Open a file to append 
fileOpen = open("file.txt", "a+") 
fileOpen.write(" Information Technology Lahore"); 
fileOpen.close() 
# Open a file to read 
fileOpen = open("file.txt", "r+") 
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characte rs from the start of file 
print (string) 
# Close opend file 
fileOpen.close()

Hello. my name is Usama Javaid. I have a Masters in Electrical Engineering.  Information Technology Lahore

## 8.3 File Position
- The below code defines the use of tell and seek functions.

In [71]:
# Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str) 
# Check current position
position = fo.tell();
print("Currentfileposition:\n", position)
#Repositionpointeratthebeginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str) 
# Close opend file
fo.close()

ReadStringis:
 Hello. my
Currentfileposition:
 10
AgainreadStringis:
 Hello. my

- The below code renames the file.

In [72]:
import os
# renameafile
os.rename("file.txt","newfile.txt")

- The below code removes the file.

In [73]:
#remove file 
os.remove("newfile.txt")

# 9. Pandas Introduction 

- Pandas is an open source library built on top of NumPy 
- It allows for fast analysis and data cleaning and preparation
- It excels in proformance and productivity 
- It also has built-in visualization features
- It can work with data from a wide variety of sources
- Used for reading structured data.

# 10. Series 

- The below codes define use of ndarray, dict, scalar value and ndarray-like types.

## 10.1  From ndarray

In [118]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
"""following a fucntion is called from pandas to create a series.Data would be 5 random values and indexes are assigned a-e"""

s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e']) 
s

a   -0.607816
b    0.514300
c   -0.139488
d   -0.050562
e    2.138872
dtype: float64

- Following function will print the index and its datatype

In [119]:
"""Following function will print the index and its datatype""" 
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [120]:
"""If we don't assign the index then it will be of length having values [0...len(data-1)]"""
pd.Series(np.random.randn(5))

0    0.866137
1   -0.237004
2    1.027830
3    1.039478
4   -0.908770
dtype: float64

## 10.2  From dict
- If data is a dict, if index is passed the values in data corresponding to the labels in the index will be pulled out.
- If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

In [121]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict""" 
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

- In following example, index are given, so the values in data corresponding in the index will be pulled out

In [122]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled out""" 
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

## 10.3  From a scalar value 
- If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [123]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of index"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## 10.4 Series is ndarray-like 
- It acts very similarly to a ndarray.
It is a valid argument to most NumPy functions. However, things like slicing also slice the index

In [124]:
#we can access a value just like ndarray 
#access single value 
s[0]

C:\Users\usama\AppData\Local\Temp\ipykernel_20316\1294392724.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.float64(-0.6078159556721474)

- Access range of values

In [125]:
 #access range of values 
s[:5]

a   -0.607816
b    0.514300
c   -0.139488
d   -0.050562
e    2.138872
dtype: float64

- Following example will return a range of values in series whose value is greater than the median of series

In [126]:
""" Following example will return a range of values in series whose value is greater than the median of series""" 
s[s > s.median()]

b    0.514300
e    2.138872
dtype: float64

- Following example is return the values in series with indexes. 4,3,1 are the positions of the indexes

In [127]:
"""Following example is return the values in series with indexes. 4,3,1 are the positions of the indexes 
For example: the index at 4,3,1 are e,d,b respectively""" 
s[[4, 3, 1]]

C:\Users\usama\AppData\Local\Temp\ipykernel_20316\2819298971.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e    2.138872
d   -0.050562
b    0.514300
dtype: float64

- Following example returns the exponent values.

In [128]:
""" Following example returns the exponent values. just like e^a (here a is index and its respective data is 
placed here)""" 
np.exp(s)

a    0.544539
b    1.672468
c    0.869804
d    0.950695
e    8.489857
dtype: float64

- Following example will get the data of given index

In [129]:
"""Following example will get the data of given index""" 
s['a']

np.float64(-0.6078159556721474)

- Following example will update the data of the given index

In [130]:
"""Following example will update the data of the given index""" 
s['e'] = 12. 
s # before updating e = 8.489857 but after updating e = 12.000000

a    -0.607816
b     0.514300
c    -0.139488
d    -0.050562
e    12.000000
dtype: float64

- Following will return true if 'e' is in the values of index otherwise false

In [73]:
""" Following will return true if 'e' is in the values of index otherwise false""" 
'e' in s

True

- What happens if label isnt there?

In [131]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """ 
s['f'] 
# This will create error

KeyError: 'f'

- Using the get method

In [132]:
"""Using the get method, a missing label will return None or specified default""" 
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

## 10.5 Vectorized operations and label alignment with Series 
- When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary.
- Series can also be passed into most NumPy methods expecting an ndarray

In [134]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculated as: a = s['a'] +
s['a'] b = s['b'] + s['b'] c = s['c'] + s['c'] d = s['d'] + s['d'] e = s['e'] + s['e'] """ 
s + s

a    -1.215632
b     1.028600
c    -0.278975
d    -0.101124
e    24.000000
dtype: float64

- Following will multiply the data of each values of indexes with 2.

In [136]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is calculated as: 
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2 
e = s['e'] *2""" 
s * 2

a    -1.215632
b     1.028600
c    -0.278975
d    -0.101124
e    24.000000
dtype: float64

In [139]:
s = pd.Series(np.random.randn(5), name='something') 
s

0   -0.292887
1   -0.276674
2   -0.539779
3   -1.680464
4   -0.234068
Name: something, dtype: float64

- print the name attribute of serie

In [141]:
s.name #print the name attribute of series

'something'

- rename the series name attribute and assign to s2 object

In [142]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects. 
s2 = s.rename("different") 
s2.name

'different'

# 11. Data Frames 

- DataFrames are the workhorse of pandas

## 11.1 From dict of Series or dicts
- Create a dataframe. row label will be the indexes of a series. As coloum labels are not given so it will be sorted list of dict keys

In [143]:
""" A dict is created """
d = { 'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
 'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']) 
} 
df=pd.DataFrame(d) 
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

- A data frame will be constructed for given row labels

In [144]:
""" a data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

- Following example shows a data frame when we give coloumn labels

In [145]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [146]:
df.columns

Index(['one', 'two'], dtype='object')

## 11.2 From dict of ndarrays / lists 
- Following examples shows that ndarray has same length

In [149]:
"""following examples shows that ndarray has same length"""
d = { 'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.] } 
"""column labels are not given so the result will be range(n), where n is the array length""" 
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

- If indexs are given then it would be same length as arrays

In [84]:
"""If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

## 11.3 From a list of dicts
- Constructing data frame from a list of dicts

In [150]:
"""constructing data frame from a list of dicts""" 
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

- Passing list of dicts as data and indexes (row labels)

In [151]:
"""passing list of dicts as data and indexes (row labels)""" 
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

- Passing list of dicts as data and columns (columns labels)

In [152]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

## 11.4 From a dict of tuples
- Automatically creating a multi-indexed frame by passing a tuples dictionary

In [154]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2}, ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4}, ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8}, ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})
 #"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## 11.5 Alternate Constructors 
- The below code demostrates the use of alternate constructors:

In [155]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')]) 
data

C:\Users\usama\AppData\Local\Temp\ipykernel_20316\3180067374.py:1: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [156]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

- Using from_items. But gives error
- Can be resolved by using from_dict()

In [166]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

- Gives error. Wasnt able to resolve even with dict()

In [168]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])], orient='index', columns=['one', 'two', 'three'])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

## 11.6 Column selection, addition, deletion  
- Operations on coloumns.

In [169]:
df['one'] # it is displaying data under coloumn 'one'

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [170]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [171]:
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [172]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

- Columns can be deleted or popped like with a dict

In [173]:
del df['two'] #delete a coloumn 'two' from data frame

In [174]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [175]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

- When inserting a scalar value, it will naturally be propagated to fill the column:

In [176]:
 df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [177]:
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

- When inserting a Series that does not have the same index as the DataFrame, it will be conformed to the DataFrames index:

In [178]:
"""following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]

In [179]:
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

- By default, columns get inserted at the end. The insert function is available to insert at a particular location in the columns:

In [180]:
"""following function has three arguments. 
First argument: index where new coloumn will be inserted. 
Second argument: label or title of a new coloumn 
Third argument: it will create a coloumn at specified position"""

df.insert(1, 'bar2', df['one'])

In [181]:
df

   one  bar2   flag  foo  one_trunc
a  1.0   1.0  False  bar        1.0
b  2.0   2.0  False  bar        2.0
c  3.0   3.0   True  bar        NaN
d  NaN   NaN  False  bar        NaN

## 11.7 Indexing / Selection   
- Row selection, for example, returns a Series whose index is the columns of the DataFrame

In [182]:
df.loc['b'] #it will return the coloumn labels and values on row label 'b'

one            2.0
bar2           2.0
flag         False
foo            bar
one_trunc      2.0
Name: b, dtype: object

In [183]:
df.iloc[2] #it will return the values of those coloumns that is > than 2

one           3.0
bar2          3.0
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

## 11.8 Data alignment and arithmetic  
- The below section depicts the data alignment and srithmetic operations.

In [184]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [185]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [186]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0  2.109832 -0.169145  0.824603 NaN
1 -0.588189  1.930489 -0.621326 NaN
2  1.267533 -3.994316 -1.237591 NaN
3 -0.149034 -0.630796 -0.179049 NaN
4 -0.219484 -1.160050  0.111341 NaN
5 -0.966592  1.099390 -1.150004 NaN
6 -0.839119 -0.157917  1.028853 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [187]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.462818  0.329311 -0.529294  2.636396
2 -0.990639 -2.534351 -1.862989  1.205719
3 -1.059928 -0.414832 -1.658320  2.524344
4 -0.616681 -0.431630 -0.931189  0.626626
5 -0.689913 -0.929265 -1.001467  4.202025
6 -1.956083 -1.062537 -0.568852  2.282806
7 -1.433878 -0.922642 -0.560758  0.526980
8 -0.325764 -0.637527 -0.451879  1.440696
9 -2.943479 -0.656038 -0.621223  0.672077

In [188]:
df*5+2

          A         B         C          D
0  7.855665  5.215850  3.946992  -6.622977
1  5.541576  6.862404  1.300522   6.559004
2  2.902470 -7.455906 -5.367951  -0.594381
3  2.556025  3.141691 -4.344607   5.998742
4  4.772258  3.057702 -0.708952  -3.489847
5  4.406101  0.569524 -1.060341  14.387148
6 -1.924748 -0.096834  1.102730   4.791055
7  0.686273  0.602638  1.143200  -3.988076
8  6.226845  2.028216  1.687596   0.580504
9 -6.861732  1.935662  0.840874  -3.262594

In [189]:
1 / df

          A           B          C         D
0  0.853874    1.554799   2.568064 -0.579846
1  1.411801    1.028298  -7.148186  1.096731
2  5.540351   -0.528770  -0.678615 -1.927242
3  8.992396    4.379469  -0.788071  1.250393
4  1.803584    4.727231  -1.845732 -0.910772
5  2.078050   -3.495340  -1.633805  0.403644
6 -1.273967   -2.384547  -5.572462  1.791437
7 -3.805967   -3.578171  -5.835667 -0.834993
8  1.182915  177.205349 -16.004928 -3.522377
9 -0.564224  -77.714634  -4.313597 -0.950102

In [190]:
df **4

          A             B         C          D
0  1.881156  1.711209e-01  0.022992   8.846041
1  0.251713  8.943839e-01  0.000383   0.691194
2  0.001061  1.279183e+01  4.715274   0.072486
3  0.000153  2.718406e-03  2.592621   0.409085
4  0.094505  2.002501e-03  0.086164   1.453319
5  0.053626  6.699498e-03  0.140346  37.670843
6  0.379636  3.092974e-02  0.001037   0.097094
7  0.004766  6.100363e-03  0.000862   2.057166
8  0.510723  1.014128e-09  0.000015   0.006496
9  9.867211  2.741503e-08  0.002888   1.227211

In [191]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [192]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [193]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [194]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [195]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [196]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

## 11.9 Transposing   
- How to/Use of Transpose.

In [197]:
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A  1.171133  0.708315  0.180494  0.111205  0.554452
B  0.643170  0.972481 -1.891181  0.228338  0.211540
C  0.389398 -0.139896 -1.473590 -1.268921 -0.541790
D -1.724595  0.911801 -0.518876  0.799748 -1.097969

- Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [198]:
dates = pd.date_range('20130101', periods=6)

In [199]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [200]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [201]:
df

                   A         B         C         D
2013-01-01  0.041612  0.221396 -0.949293  0.214663
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385
2013-01-04  0.004448  0.759398 -1.220958  0.045582
2013-01-05  0.105459 -0.351591  0.185854 -0.350329
2013-01-06 -1.032255 -0.486715 -0.816309  1.540473

- Creating a DataFrame by passing a dict of objects that can be converted to series-like

In [202]:
df2 = pd.DataFrame({ 'A' : 1., 
'B' : pd.Timestamp('20130102'),
 'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
 'D' : np.array([3] * 4,dtype='int32'),
 'E' : pd.Categorical(["test","train","test","train"]),
 'F' : 'foo' })

In [203]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [204]:
#Having specific dtypes 
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# 12. Viewing Data 

- The below code defines viewing data:

In [205]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01  0.041612  0.221396 -0.949293  0.214663
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385
2013-01-04  0.004448  0.759398 -1.220958  0.045582
2013-01-05  0.105459 -0.351591  0.185854 -0.350329

In [206]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04  0.004448  0.759398 -1.220958  0.045582
2013-01-05  0.105459 -0.351591  0.185854 -0.350329
2013-01-06 -1.032255 -0.486715 -0.816309  1.540473

In [207]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [208]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [209]:
df.values # print values

array([[ 0.04161222,  0.22139569, -0.94929264,  0.21466339],
       [ 0.33962457, -0.86758966,  0.59868392, -0.72439799],
       [ 1.88270173, -1.01281292, -0.15511803, -0.81738451],
       [ 0.00444792,  0.75939753, -1.22095839,  0.04558184],
       [ 0.10545909, -0.35159138,  0.18585361, -0.35032882],
       [-1.03225456, -0.4867153 , -0.81630884,  1.54047259]])

In [210]:
# Transposing your data 
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.041612    0.339625    1.882702    0.004448    0.105459   -1.032255
B    0.221396   -0.867590   -1.012813    0.759398   -0.351591   -0.486715
C   -0.949293    0.598684   -0.155118   -1.220958    0.185854   -0.816309
D    0.214663   -0.724398   -0.817385    0.045582   -0.350329    1.540473

In [211]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.214663 -0.949293  0.221396  0.041612
2013-01-02 -0.724398  0.598684 -0.867590  0.339625
2013-01-03 -0.817385 -0.155118 -1.012813  1.882702
2013-01-04  0.045582 -1.220958  0.759398  0.004448
2013-01-05 -0.350329  0.185854 -0.351591  0.105459
2013-01-06  1.540473 -0.816309 -0.486715 -1.032255

In [216]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-06 -1.032255 -0.486715 -0.816309  1.540473
2013-01-05  0.105459 -0.351591  0.185854 -0.350329
2013-01-01  0.041612  0.221396 -0.949293  0.214663
2013-01-04  0.004448  0.759398 -1.220958  0.045582

In [217]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.223598 -0.289653 -0.392857 -0.015232
std    0.942163  0.672506  0.714040  0.864340
min   -1.032255 -1.012813 -1.220958 -0.817385
25%    0.013739 -0.772371 -0.916047 -0.630881
50%    0.073536 -0.419153 -0.485713 -0.152373
75%    0.281083  0.078149  0.100611  0.172393
max    1.882702  0.759398  0.598684  1.540473

In [219]:
 #Selecting a single column, which yields a Series, equivalent to df.A 
df['A']

2013-01-01    0.041612
2013-01-02    0.339625
2013-01-03    1.882702
2013-01-04    0.004448
2013-01-05    0.105459
2013-01-06   -1.032255
Freq: D, Name: A, dtype: float64

In [220]:
#Selecting via [], which slices the rows. 
df[0:3]

                   A         B         C         D
2013-01-01  0.041612  0.221396 -0.949293  0.214663
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385

In [221]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385
2013-01-04  0.004448  0.759398 -1.220958  0.045582

In [222]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.041612  0.221396
2013-01-02  0.339625 -0.867590
2013-01-03  1.882702 -1.012813
2013-01-04  0.004448  0.759398
2013-01-05  0.105459 -0.351591
2013-01-06 -1.032255 -0.486715

In [223]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.339625 -0.867590
2013-01-03  1.882702 -1.012813
2013-01-04  0.004448  0.759398

In [224]:
 # Reduction in the dimensions of the returned object 
df.loc['20130102',['A','B']]

A    0.339625
B   -0.867590
Name: 2013-01-02 00:00:00, dtype: float64

In [225]:
# For getting a scalar value 
df.loc[dates[0],'A']

np.float64(0.041612218257731495)

In [226]:
# For getting fast access to a scalar 
df.at[dates[0],'A']

np.float64(0.041612218257731495)

In [227]:
# Select via the position of the passed integers 
df.iloc[3]

A    0.004448
B    0.759398
C   -1.220958
D    0.045582
Name: 2013-01-04 00:00:00, dtype: float64

In [228]:
 # By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.004448  0.759398
2013-01-05  0.105459 -0.351591

In [229]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.339625  0.598684
2013-01-03  1.882702 -0.155118
2013-01-05  0.105459  0.185854

In [230]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  0.221396 -0.949293
2013-01-02 -0.867590  0.598684
2013-01-03 -1.012813 -0.155118
2013-01-04  0.759398 -1.220958
2013-01-05 -0.351591  0.185854
2013-01-06 -0.486715 -0.816309

In [231]:
# For getting a value explicitly 
df.iloc[1,1]

np.float64(-0.8675896648148513)

In [232]:
# Using a single columns values to select data. 
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.041612  0.221396 -0.949293  0.214663
2013-01-02  0.339625 -0.867590  0.598684 -0.724398
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385
2013-01-04  0.004448  0.759398 -1.220958  0.045582
2013-01-05  0.105459 -0.351591  0.185854 -0.350329

In [233]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  0.041612  0.221396       NaN  0.214663
2013-01-02  0.339625       NaN  0.598684       NaN
2013-01-03  1.882702       NaN       NaN       NaN
2013-01-04  0.004448  0.759398       NaN  0.045582
2013-01-05  0.105459       NaN  0.185854       NaN
2013-01-06       NaN       NaN       NaN  1.540473

In [234]:
# Using the isin() method for filtering:
df2 = df.copy()

In [235]:
df2['E'] = ['one', 'one','two','three','four','three']

In [236]:
df2

                   A         B         C         D      E
2013-01-01  0.041612  0.221396 -0.949293  0.214663    one
2013-01-02  0.339625 -0.867590  0.598684 -0.724398    one
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385    two
2013-01-04  0.004448  0.759398 -1.220958  0.045582  three
2013-01-05  0.105459 -0.351591  0.185854 -0.350329   four
2013-01-06 -1.032255 -0.486715 -0.816309  1.540473  three

In [237]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.882702 -1.012813 -0.155118 -0.817385   two
2013-01-05  0.105459 -0.351591  0.185854 -0.350329  four